In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.DataFrame(np.arange(6).reshape((2,3)),
                   index=pd.Index(['Ohio','Colorado'], name='state'),
                   columns=pd.Index(['one','two','three'], name='number'))

In [3]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [4]:
result = data.stack() #row pivot

In [5]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [6]:
result.unstack() #column pivot

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [10]:
result.unstack(1) #number

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [11]:
result.unstack(0) #state

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [13]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [14]:
result.unstack('number')

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5